Q1. List any five functions of the pandas library with execution.

Ans: 
1. read_csv()
This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame. All you need to do is mention the path of the file you want it to read. It can also read files separated by delimiters other than comma, like | or tab. 
2. head()
head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. If you want more/less number of rows, you can specify n as an integer.
3. describe()
describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series. It summarizes central tendency and dispersion of the dataset. describe() helps in getting a quick overview of the dataset. 
4. memory_usage()
memory_usage() returns a Pandas Series having the memory usage of each column (in bytes) in a Pandas DataFrame. By specifying the deep attribute as True, we can get to know the actual space being taken by each column.
5. astype()
astype() is used to cast a Python object to a particular data type. It can be a very helpful function in case your data is not stored in the correct format (data type). For instance, if floating point numbers have somehow been misinterpreted by Python as strings, you can convert them back to floating point numbers with astype(). Or if you want to convert an object datatype to category, you can use astype().

data_1['Gender'] = data_1.Gender.astype('category')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [53]:
import pandas as pd
x = {'A':['a','b','c'], 'B':['d','e','f'], 'C':['g','h','i']}
df = pd.DataFrame(x)

In [54]:
df

   A  B  C
0  a  d  g
1  b  e  h
2  c  f  i

In [59]:
df.reindex([1,3])

     A    B    C
1    b    e    h
3  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [64]:
col = {'Values' : [10, 20, 30, 40, 50]}

In [65]:
t= pd.DataFrame(col)

In [66]:
t

   Values
0      10
1      20
2      30
3      40
4      50

In [67]:
def sum_three(t):
    first_three = t.iloc[:3]  # to select first three rows
    return first_three.sum()
sum_three(t)

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [69]:
data_set = {'Text': ['hello', 'absolutely', 'thought']}
df3 = pd.DataFrame(data_set)

In [70]:
df3

         Text
0       hello
1  absolutely
2     thought

In [71]:
df3['Word_Count'] = df3['Text'].str.len()

In [72]:
df3

         Text  Word_Count
0       hello           5
1  absolutely          10
2     thought           7

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans: DataFrame.size it is return number_row*number_column

In [73]:
df = pd.DataFrame({'name':['Abhi','shri','Vyas','Ritik'],
                   'Age':[3,4,5,7]})
df

    name  Age
0   Abhi    3
1   shri    4
2   Vyas    5
3  Ritik    7

In [74]:
df.size  # No of rows * number of column

8

DataFrame.shape it is return number_row and number_column

In [76]:
df.shape  # it shows how many number of rows and columns

(4, 2)

Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("test.xls")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [79]:
add = {'Email': ['abc@gmail.com','def@gmail.com','klm@gmail.com']}

In [80]:
d = pd.DataFrame(add)

In [81]:
d

           Email
0  abc@gmail.com
1  def@gmail.com
2  klm@gmail.com

In [86]:
d[['username','company']] = d['Email'].str.split('@', expand = True,)

In [87]:
d

           Email username    company
0  abc@gmail.com      abc  gmail.com
1  def@gmail.com      def  gmail.com
2  klm@gmail.com      klm  gmail.com

In [88]:
d.drop(d.columns[2], axis = 1)

           Email username
0  abc@gmail.com      abc
1  def@gmail.com      def
2  klm@gmail.com      klm

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [93]:
data = [[ 3, 5, 1],[8, 2, 7],[6, 9, 4],[2, 3, 5],[9, 1, 2]]
df = pd.DataFrame(data, columns = ['A','B','C'])

In [94]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [95]:
new_df = df[(df['A']>5) & (df['B']<10)]

In [96]:
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [97]:
df = pd.DataFrame({'Values': [10,11,12,14,15,16]})
df

   Values
0      10
1      11
2      12
3      14
4      15
5      16

In [98]:
df.describe()

          Values
count   6.000000
mean   13.000000
std     2.366432
min    10.000000
25%    11.250000
50%    13.000000
75%    14.750000
max    16.000000

In [99]:
df.mean()

Values    13.0
dtype: float64

In [100]:
df.median()

Values    13.0
dtype: float64

In [102]:
df.std()

Values    2.366432
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [103]:
import numpy as np

In [105]:
df = pd.DataFrame(pd.date_range(start='2023-06-10' , end = '2023-06-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     122 2023-06-10
1     620 2023-06-11
2     198 2023-06-12
3     731 2023-06-13
4     609 2023-06-14
5     815 2023-06-15
6     458 2023-06-16
7     739 2023-06-17
8     914 2023-06-18
9     477 2023-06-19
10    322 2023-06-20
11    472 2023-06-21
12    184 2023-06-22
13    856 2023-06-23
14    260 2023-06-24
15    857 2023-06-25
16    800 2023-06-26

In [106]:
df['Moving Average'] = df['Sales'].rolling(window=7).mean().round(2)
df

         Date  Sales  Moving Average
0  2023-06-10    122             NaN
1  2023-06-11    620             NaN
2  2023-06-12    198             NaN
3  2023-06-13    731             NaN
4  2023-06-14    609             NaN
5  2023-06-15    815             NaN
6  2023-06-16    458          507.57
7  2023-06-17    739          595.71
8  2023-06-18    914          637.71
9  2023-06-19    477          677.57
10 2023-06-20    322          619.14
11 2023-06-21    472          599.57
12 2023-06-22    184          509.43
13 2023-06-23    856          566.29
14 2023-06-24    260          497.86
15 2023-06-25    857          489.71
16 2023-06-26    800          535.86

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date

0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [107]:
date = pd.date_range(start='2023-01-01' , end = '2023-01-05')
df = pd.DataFrame({'Date':date})
df

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [108]:
df['Weekday'] = df['Date'].dt.day_name()
df

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [109]:
data = pd.date_range(start='2022-12-01', end='2023-02-28')
df_date = pd.DataFrame(data, columns=['Date'])
df_date

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [110]:
start = '2023-01-01'
end =  '2023-01-31'
mask = (df['Date'] > start) & (df['Date'] < end)
df.loc[mask]

        Date    Weekday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

As Pandas is dependent on the NumPy library, we need to import this dependency.